{"inkVersion":21,"root":[[{"->":"start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"start":[["^You are a fish swimming in a peaceful coral reef. The water is clear, and the sun shines down from the surface. You feel at home in the calm, vibrant world of the reef. Suddenly, you notice a shadow pass overhead.","\n","ev","str","^Investigate the shadow","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Ignore it and continue swimming","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"shadow"},"\n",{"#f":5}],"c-1":["^ ",{"->":"swim"},"\n",{"#f":5}]}],{"#f":1}],"shadow":[["^You decide to investigate the shadow. As you swim closer to the surface, you spot a large fish, a predator, circling above. It hasn’t noticed you yet.","\n","ev","str","^Hide in a nearby coral","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Try to confront the predator","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"hide"},"\n",{"#f":5}],"c-1":["^ ",{"->":"confront"},"\n",{"#f":5}]}],{"#f":1}],"swim":[["^You decide to continue swimming through the reef, enjoying the beauty around you. You pass schools of smaller fish and vibrant plants. As you drift further, you notice an interesting cave ahead.","\n","ev","str","^Enter the cave","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Swim away from the cave","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"cave"},"\n",{"#f":5}],"c-1":["^ ",{"->":"swimAway"},"\n",{"#f":5}]}],{"#f":1}],"hide":["^You quickly hide in the coral, hoping the predator doesn’t spot you. You wait in silence, holding your breath. After a while, the predator moves on, and the reef is peaceful again.","\n",{"->":"start"},{"#f":1}],"confront":["^You bravely swim up to the predator. It turns and stares at you with wide eyes. For a tense moment, you think it might attack. But then, it slowly swims away, uninterested.","\n",{"->":"start"},{"#f":1}],"cave":[["^The cave is dark and mysterious. As you venture further inside, you find a hidden treasure – a beautiful pearl shining in the dark.","\n","ev","str","^Take the pearl","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Leave it behind","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"pearl"},"\n",{"#f":5}],"c-1":["^ ",{"->":"leavePearl"},"\n",{"#f":5}]}],{"#f":1}],"swimAway":["^You swim past the cave, moving toward the deeper waters. The reef fades away behind you, and you enter the unknown.","\n",{"->":"start"},{"#f":1}],"pearl":["^You decide to take the pearl. As you leave the cave, you feel proud of your find. But you must be careful – other creatures might want it too.","\n",{"->":"start"},{"#f":1}],"leavePearl":["^You decide to leave the pearl where it lies. It’s a beautiful sight, but you feel it’s better to leave it untouched.","\n",{"->":"start"},{"#f":1}],"#f":1}],"listDefs":{}}